# Преобразование типов:
#
# int(), float(), str(), bool(), list(), tuple(), set(), dict(): Функции для преобразования значений в различные типы данных.
# Математические функции:
#
# abs(): Возвращает абсолютное значение числа.
# max(): Возвращает наибольший элемент.
# min(): Возвращает наименьший элемент.
# sum(): Возвращает сумму элементов.
# pow(): Возвращает x в степени y (x ** y).
# Функции работы с последовательностями:
#
# len(): Возвращает длину объекта (количество элементов).
# sorted(): Возвращает отсортированный список элементов.
# reversed(): Возвращает обратный итератор.
# Функции для работы с файлами и вводом/выводом:
#
# open(): Открывает файл и возвращает объект файла.
# input(): Считывает пользовательский ввод с клавиатуры.
# print(): Выводит данные на консоль.
# Функции для работы с объектами:
#
# type(): Возвращает тип объекта.
# id(): Возвращает уникальный идентификатор объекта.
# callable(): Проверяет, является ли объект вызываемым (функцией, методом и т.д.).
# Другие полезные функции:
#
# range(): Возвращает последовательность чисел.
# enumerate(): Перечисляет элементы последовательности вместе с их индексами.
# zip(): Объединяет элементы нескольких последовательностей в кортежи.


import builtins
import textwrap
from tabulate import tabulate
#
# ---------------------------+----------------------+--------------------+-----------------------+------------------------+--------------------+-------------------+-----------+-------+------------+------------+-------------+----------+-----------+-------+------+----------+
# | all                       | anext                | any                | ascii                 | bin                    | bool               | breakpoint        | bytearray | bytes | callable   | chr        | classmethod | compile  | complex   |       |      |          |
# +---------------------------+----------------------+--------------------+-----------------------+------------------------+--------------------+-------------------+-----------+-------+------------+------------+-------------+----------+-----------+-------+------+----------+
# | copyright                 | credits              | delattr            | dict                  | dir                    | divmod             | enumerate         | eval      | exec  | exit       | filter     | float       | format   | frozenset |       |      |          |
# +---------------------------+----------------------+--------------------+-----------------------+------------------------+--------------------+-------------------+-----------+-------+------------+------------+-------------+----------+-----------+-------+------+----------+
# | getattr                   | globals              | hasattr            | hash                  | help                   | hex                | id                | input     | int   | isinstance | issubclass | iter        | len      | license   | list  |      |          |
# +---------------------------+----------------------+--------------------+-----------------------+------------------------+--------------------+-------------------+-----------+-------+------------+------------+-------------+----------+-----------+-------+------+----------+
# | locals                    | map                  | max                | memoryview            | min                    | next               | object            | oct       | open  | ord        | pow        | print       | property | quit      | range | repr | reversed |
# +---------------------------+----------------------+--------------------+-----------------------+------------------------+--------------------+-------------------+-----------+-------+------------+------------+-------------+----------+-----------+-------+------+----------+
# | round                     | set                  | setattr            | slice                 | sorted                 | staticmethod       | str               | sum       | super | tuple      | type       | vars        | zip

# from prettytable import PrettyTable
#
# functions_list = dir(builtins)
# pretty_table = PrettyTable()
# pretty_table.field_names = ["Built-in Functions"]
#
# for function in functions_list:
#     if "__" not in function:  # exclude function names with __
#         if function[0].islower():
#             pretty_table.add_row([function])
#
# print(pretty_table)
