# = : Присваивает значение справа операнда на слева. Пример: x = 5 - Это означает, что x равно 5.
# += : Присваивает значение слева так, что оно увеличивается на значение справа. Пример: x += 3 - Это эквивалентно x = x + 3.
# -= : Присваивает значение слева так, что оно уменьшается на значение справа. Пример: x -= 3 - Это эквивалентно x = x - 3.
# *= : Умножает левую переменную на правую и присваивает это значение к переменной слева. Пример: x *= 3 - Это эквивалентно x = x * 3.
# /= : Делит левую переменную на правую и присваивает это значение к переменной слева. Пример: x /= 3 - Это эквивалентно x = x / 3.
# //= : Делит левую переменную на правую, преобразуя результат к целому числу, и присваивает это значение к переменной слева. Пример: x //= 3 - Это эквивалентно x = x // 3.
# **= : Возводит левую переменную в степень значения правой и присваивает это значение к переменной слева. Пример: x **= 3 - Это эквивалентно x = x ** 3.
# %= : Возвращает остаток от деления левой переменной на правую и присваивает это значение к переменной слева. Пример: x %= 3 - Это эквивалентно x = x % 3.


